Autodesk.Revit.DB.MaterialNode.GetColorWithTransparency
Returns material color with transparency.
Remarks:
The value may differ from the default color property of the material,
because it might have been overridden by rendering settings.
And could also be differ from Color property of the same material node
When override transparency is specificed since Color will be marked as invalid in this case
Returns:
An instance of a ColorWithTransparency.
Since:
2014

Autodesk.Revit.DB.MaterialNode.GetAppearanceOverride
Returns appearance properties that override the preset appearance of the material.
Remarks:
The returned instance of an Asset is valid only if there is an overide, which happens
if there are decals applied to the face that has the base material. In such cases the
rendering engine takes the asset of the material and merges it with the decal,
which results to this override asset. If there are no decals, this instance is null
and the HasOverriddenAppearance returns False.
Returns:
An instance of a rendering material asset, of null if there is no override.
Since:
2014

Autodesk.Revit.DB.MaterialNode.GetAppearance
Appearance properties associated with the material.
Remarks:
Properties and attributes of the material's appearance
can be accessed using the standard interface of the Asset class.
The structure of the properties, including their types and names
is proprietary and as such it is not always useful to anyone who
is not familiar with the particular schema. Also, the structure
is not standardized and may change over time, therefore it is not
recommended relaying on any appearance property to be present.
Returns:
An instance of a rendering material asset
Since:
2014

Autodesk.Revit.DB.MaterialNode.ThumbnailFile
The path if a file that contains a thumbnail image of the material.
Since:
2014

Autodesk.Revit.DB.MaterialNode.Glossiness
The level of glossiness of the material
Since:
2014

Autodesk.Revit.DB.MaterialNode.Smoothness
The level of smoothness of the material.
Since:
2014

Autodesk.Revit.DB.MaterialNode.Color
The color the material is being rendered at
Remarks:
The value may differ from the default color property of the material,
because it might have been overridden by rendering settings.
Since:
2014

Autodesk.Revit.DB.MaterialNode.Transparency
The value of transparency the material is being rendered with
Since:
2014

Autodesk.Revit.DB.MaterialNode.MaterialId
The Id of the element assocated with this material in the model.
Remarks:
It is possible that no specific material is applied to a face, in which case
the default material is used, and this property returns an InvalidElementId.
Since:
2014

Autodesk.Revit.DB.MaterialNode.HasOverriddenAppearance
Identifies if the default rendering appearance the material has is being overridden.
Since:
2014

Autodesk.Revit.DB.MaterialNode
This class represents a change of material during a model-exporting process.
Remarks:
Output nodes following this node are to be assumed using the material.
The material remains in effect until another material node is sent to the output.
See also: Autodesk::Revit::DB::IExportContext::OnMaterial.
Since:
2014